taurus/performance_test/stress_test/stress_test1.yml
execution:
- executor: gatling
  concurrency: 100
  ramp-up: 10s
  hold-for: 30s
  scenario:
    script: health.scala
    simulation: src.test.taurus.performance_test.BasicSimulation
    keepalive: true

# http://gettaurus.org/docs/ScenarioBuilding/

reporting:
  - module: final-stats
    dump-xml: health-scala-stats.xml